[Translator]
Name=Shamsiddinov Zafar
Updated=

[LanguageString]
Record=Yozmoq
Resume=Yangilamoq
Pause=Pauza
Encoding=Kodlash
Capture=Olmoq
Area=Hudud
Resize=O‘lcham
Open=Ochmoq
Options=Tanlovlar
Report=Hisobot
Info=Ma'lumot
Hotkey=Tezkor tugma
Hotkeys=Tezkor tugmalar
Save=Saqlash
Codecs=Kodeklar
Timelimit=Cheklov
Stop=To‘xtatish
Confirm=Tasdiqlash
Version=Versiya
Language=Til
Stereo=Streo
Mono=Mono
Sound=Ovoz
Warning=Diqqat
Error=Xatolik
Information=Ma'lumot
Confirm=Tasdiqlash
Effect=Ajratish
&Yes=&Ha
&No=&Yo‘q
&OK=&OK
&Cancel=&Bekor qilmoq
&Abort=&Uzmoq
&Retry=&Takroran
&Ignore=&Rad etmoq
KeyframeRate=Muhim kadrlar soni
ModifiedWindowsHostFile=Hosts Windows faylida o‘zgarish aniqlandi.
StopRecording=Ekranni yozishni to‘xtatmoq.
StartRecording.=Ekranni yozishni boshlamoq.
CaptureScreen=Ekranni olmoq.
CopyToClipboard=Buferga nusxalamoq
PressKeyStopRecording=Yozishni to‘xtatish uchun %sni bosing.
RecordingFailed=Yozishda xatolik.
CauseAudioSynthesis=Sabab (audio sintez): 
NotExistDefaultOutputPath=Tayinlangan yo‘lak mavjud emas. Sukut bo‘yicha yo‘lak o‘rnatildi.
UpdateNewVersion=oCamni oxirgi versiyagacha yangilamoq.
SelectAreaToRecord=Yozish hududini tanlamoq.
ResizeRecordingArea=Yozish hududi o‘lchamini o‘zgartirmoq.
ChangeSettings=Dasturning asosiy tanlovlari.
DisplaySoftwareInformation=Dastur haqida va litsenziya ma'lumotnomasini ko‘rsatmoq.
OpenOutputPath=Tayinlangan jildni ochmoq.
BrowseForFolder=Jildni ko‘rmoq
FailedRecordRegisterHotkey="Yozmoq" tezkor tugmasi o‘rnatilmagan.
FailedPauseRegisterHotkey="Pauza" tezkor tugmasi o‘rnatilmagan.
FailedCaptureRegisterHotkey="Ekranni olmoq" tezkor tugmasi o‘rnatilmagan.
FailedRecordAreaRegisterHotkey="Yozish hududi tanlovi" tezkor tugmasi o‘rnatilmagan.
PleaseChangeHotkey=Marhamat, tezkor tugmani o‘zgartiring.
LanguageChanged=Til o‘zgardi. Dasturga keyingi safar kirganda o‘zgarish qabul qilinadi.
DownloadCodecs=Internetdan kodeklarni ko‘chirib olmoq.
WhenUsedGoodCodecs=Tavsiya etilgan oCam bilan ishlatiladigan kodeklar.
GotoCodecPage=Internetda kodeklar sahifasiga o‘tishni xohlaysizmi?
DontShowAgain=Boshqa ko‘rsatmaslik.
RecordingStarting=Boshlanmoqda...
RecordingStopping=To‘xtatilmoqda...
FailedInitWASSoundLibDLL=Ovoz kutubxonasini kiritishda xatolik. Windows Audio xizmati qo‘shilganligini tekshirib ko‘ring.
JPEGQuality=JPEG sifati
CompressQuality=Siqish sifati
Enabled=Yoqilgan
Disabled=O‘chgan
Used=Ishlatmoq
NotUsed=Ishlatmaslik
LowDiskSpace=Diskda yetarli joy yo‘q.
Watermark=Suv belgi.
RecordSystemAudio=Tizim tovushlarini yozib olmoq
DoNotRecordMicrophone=Mikrofonni yozmaslik
DoNotRecordSystemAudio=Tizim ovozlarini yozmaslik
UltraHigh=O‘ta yuqori
VeryHigh=Juda yuqori
High=Yuqori
Medium=O‘rtacha
Low=Past
VeryLow=Juda past
CantNotLoadImage=Fayldan suv belgisini yuklab bo‘lmadi.
NotFoundTheTargetRecordWindow=Yozish uchun oyna topilmadi.
RecordingGame=O‘yin
FileName=Fayl nomi
MonitorNotSupportResolution=Monitor does not support the resolution.
HalfSize=Half size
FitWidth=Fit width
FitHeight=Fit height
Custom=Custom

[frmMain]
mnuRecordScreen.Caption=&To‘liq ekran
mnuPrimaryMonitor.Caption=&Bosh monitor
mnuSecondaryMonitor.Caption=&Ikkinchi darajali monitor
mnuFindTarget.Caption=Hududni &tanlash...
mnuISOMPEG1standard.Caption=ISO MPEG-1 standart ( .AVI )
mnuISOMPEG2standard.Caption=ISO MPEG-2 standart ( .AVI )
mnuISOMPEG4standard.Caption=ISO MPEG-4 standart ( .AVI )
mnuXvid.Caption=ISO MPEG-4 XVID ( .AVI )
mnuOpenDivx.Caption=ISO MPEG-4 OpenDivx ( .AVI )
mnuMicrosoftMPEG4part2.Caption=Microsoft MPEG-4 2-qism ( .AVI )
mnuMicrosoftMPEG4part3.Caption=Microsoft MPEG-4 3-qism ( .AVI )
mnuFlashVideo.Caption=Flash Video ( .FLV )
mnuISOMPEG4standardMP4.Caption=ISO MPEG-4 standart ( .MP4 )
mnuAppleQuickTime.Caption=Apple QuickTime ( Sony Vegas editable ) ( .MOV )
mnuMPEG2TransportStream.Caption=MPEG-2 transport oqim ( .TS )
mnuMPEG2PSformat.Caption=MPEG-2 PS ( .VOB )
mnuVFWCodec.Caption=Kengaytirilgan kodeklar... ( .AVI )
mnuISOMPEG4standardWMV.Caption=Microsoft MPEG-4 3-qism ( .WMV )
mnuISOWMV2.Caption=Windows Media Video 8 ( .WMV )
mnuMP3AudioCodec.Caption=MPEG audio layer 3 ( .MP3 )
mnuWMAAudioCodec.Caption=Windows Media Audio 2 ( .WMA )
ActionManager.Categorys.&Mode=Rejim
ActionManager.Categorys.&Tools=Uskunalar
ActionManager.Categorys.&Help=Yordam
actOptions.Caption=&Moslashtirish...
actInformation.Caption=&Dastur haqida...
mnuRecordingTheScreenAndAudio.Caption=Rasm va tovushni yozib olmoq
mnuRecordingOnlyAudio.Caption=Tovushni yozib olmoq

[frmOption]
btnOK.Caption=&OK
btnCancel.Caption=&Отмена
gbxVideoEncoding.Caption=Video
lblFPS.Caption=FPS : 
lblKeyframeRate.Caption=Muhim kadrlar soni:
lblVideoBitrate.Caption=Bitreyt : 
gbxAudioEncoding.Caption=Audio
lblAudioBitrate.Caption=Bitreyt : 
btnRestoreDefaultSettings.Caption=&Sukut bo‘yicha
lblSampleRate.Caption=Diskretizatsiya chastotasi: 
lblAudioDrive.Caption=Qurilma:
lblChannel.Caption=Kanal: 
chkAudio.Caption=Audio qurilmani moslash
chkRecordCursor.Caption=Sichqoncha &kursorini ham tutish
chkBalanceReposition.Caption=Yozish oynasi joyi ko‘chirilganda asosiy oyna ham ko‘chiriladi.
gbxHotkeySettings.Caption=Tezkor tugmalarni moslash
lblCaptureHotkey.Caption=Tutish:
lblRecordHotkey.Caption=Yozish: 
lblPauseHotkey.Caption=Pauza: 
lblTargetHotkey.Caption=Nishon:
lbledtOutputPath.Caption=Tayinlangan yo‘lak:
gbxRservationRecord.Caption=Yozish vaqtini cheklash
lblMin.Caption=daqiqa
lblSecond.Caption=soniya
lblAfterCompletion.Caption=tugagandan keyin
chkRecordingTimeLimite.Caption=&Yoqilgan
gbxLanguage.Caption=Tilni moslash
lblLanguage.Caption=Til:
Caption=Moslashtirish
tsInformation.Caption=Ma'lumot
tsLicense.Caption=Litsenzion kelishuv
lblCaptureFormat.Caption=Yozish uchun fayl formati:
lblUsingMultiCore.Caption=Ko‘p oqimlilikni qo‘llash: 
gbxMouseEffect.Caption=Sichqoncha kursorini ajratib ko‘rsatish
chkEnabledMouseEffect.Caption=Yoqilgan
lblMouseEffectColor.Caption=Rang:
lblMouseEffectSize.Caption=Hajmi:
gbxTimeLimitSettings.Caption=Tanlovlar
rbTimeLimitDoNothing.Caption=Hech nima qilmaslik
rbTimeLimitStartNewRecording.Caption=Yangidan yozmoq
rbTimeLimitExitProgram.Caption=Dasturdan chiqmoq
rbTimeLimitShutdown.Caption=Komputerni o‘chirib qo‘ymoq
gbxWatermarkSettings.Caption=Videoga suv belgisini qo‘shmoq
chkUseWatermark.Caption=Suv belgisini ishlatmoq
lbledtWatermakrImagePath.Caption=Rasm yo‘lagi: 
lblOpacity.Caption=Shaffoflik: 
gbxWatermarkImagePosition.Caption=O‘rni
lblVideoQuality.Caption=Sifati: 
lblEncoderThreadCount.Caption=Oqimlar soni: 
chkShowFPSOverlay.Caption=FPSni ko‘rsatmoq
gbxGameRecording.Caption=O‘yinni yozmoq
lblColorConversionQuality.Caption=Rang uzatish sifati: 
pmnuPrefixDateTime.Caption=Prefix + Date + Time
pmnuProgramNameDateTime.Caption=ProgramName + Date + Time
pmnuUserIDDateTime.Caption=UserID + Date + Time
pmnuDisplayUserNameDateTime.Caption=DisplayUserName + Date + Time
pmnuPrefixLocalizationDateNumber.Caption=Prefix + LocalizationDate + Number(#)
pmnuProgramNameLocalizationDateNumber.Caption=ProgramName + LocalizationDate + Number(#)
pmnuUserIDLocalizationDateNumber1.Caption=UserID + LocalizationDate + Number(#)
pmnuDisplayUserNameLocalizationDateNumber1.Caption=DisplayUserName + LocalizationDate + Number(#)
pmnuPrefixNumber1.Caption=Prefix + Number(#)
pmnuPrefixNumber2.Caption=Prefix + Number(##)
pmnuPrefixNumber3.Caption=Prefix + Number(###)
pmnuProgramNameNumber1.Caption=ProgramName + Number(#)
pmnuProgramNameNumber2.Caption=ProgramName + Number(##)
pmnuProgramNameNumber3.Caption=ProgramName + Number(###)
pmnuNumber1.Caption=Number(#)
pmnuNumber2.Caption=Number(##)
pmnuNumber3.Caption=Number(###)
pmnuHelp.Caption=&Yordam...
ledtFileName.Caption=Fayl nomi: 
chkHideDragCursorInRecordingArea.Caption=Hide drag cursor in recording area
gbResizeVideo.Caption=Resize
chkResizeVideo.Caption=Resize a video
lblResolution.Caption=Resolution:
lblResizeQuality.Caption=Quality: 

[frmAbout]
lblDescription.Caption=oCam - bu 100% uy va ofis uchun bepul dastur.
btnOK.Caption=&OK
btnSendReport.Caption=Xatolik haqida xabar bermoq...
Caption=Dastur haqida
tsInformation.Caption=Ma'lumot
tsLicense.Caption=Litsenzion kelishuv

[frmVFWCodecs]
Caption=Kengaytirilgan kodeklar
chkUseVFWCodec.Caption=&Kengaytirilgan kodeklardan foydalanmoq
btnDownloadCodecs.Caption=Kengaytirilgan kodeklarni yuklab olmoq...
btnVideoConfiguration.Caption=&Moslashtirish
btnInformation.Caption=&Dastur haqida
btnOK.Caption=&OK
btnCancel.Caption=&Bekor qilmoq